Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129XKCZAD.svd
<?xml version="1.0" encoding="UTF-8"?>

<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>Texas Instruments</vendor>
  <vendorID>TI</vendorID>
  <name>TM4C129XKCZAD</name>
  <series>TM4C</series>
  <version>12591</version>
  <description>ARM Cortex-M4 Tiva TM4C Device</description>
  <licenseText>
\n
    Software License Agreement\n
\n
    Texas Instruments (TI) is supplying this software for use solely and\n
    exclusively on TI's microcontroller products. The software is owned by\n
    TI and/or its suppliers, and is protected under applicable copyright\n
    laws. You may not combine this software with "viral" open-source\n
    software in order to form a larger program.\n
\n
    THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.\n
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT\n
    NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n
    A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY\n
    CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL\n
    DAMAGES, FOR ANY REASON WHATSOEVER.\n
\n
  </licenseText>
  <cpu>
    <name>CM4</name>
    <revision>r1p2</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_TM4C129</headerSystemFilename>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>0</resetMask>
  <peripherals>
    <peripheral>
      <name>WATCHDOG0</name>
      <description>Register map for WATCHDOG0 peripheral</description>
      <groupName>WATCHDOG</groupName>
      <prependToName>WATCHDOG0</prependToName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>WATCHDOG0</name><value>18</value></interrupt>
      <registers>
        <register>
          <name>LOAD</name>
          <description>Watchdog Load</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>WDT_LOAD</name>
              <description>Watchdog Load Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE</name>
          <description>Watchdog Value</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>WDT_VALUE</name>
              <description>Watchdog Value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Watchdog Control</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>WDT_CTL_INTEN</name>
              <description>Watchdog Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WDT_CTL_RESEN</name>
              <description>Watchdog Reset Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WDT_CTL_INTTYPE</name>
              <description>Watchdog Interrupt Type</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WDT_CTL_WRC</name>
              <description>Write Complete</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Watchdog Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>WDT_ICR</name>
              <description>Watchdog Interrupt Clear</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Watchdog Raw Interrupt Status</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>WDT_RIS_WDTRIS</name>
              <description>Watchdog Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Watchdog Masked Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>WDT_MIS_WDTMIS</name>
              <description>Watchdog Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>Watchdog Test</description>
          <addressOffset>0x00000418</addressOffset>
          <fields>
            <field>
              <name>WDT_TEST_STALL</name>
              <description>Watchdog Stall Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Watchdog Lock</description>
          <addressOffset>0x00000C00</addressOffset>
          <fields>
            <field>
              <name>WDT_LOCK</name>
              <description>Watchdog Lock</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDT_LOCK_UNLOCKED</name>
                  <description>Unlocked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_LOCK_LOCKED</name>
                  <description>Locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_LOCK_UNLOCK</name>
                  <description>Unlocks the watchdog timer</description>
                  <value>0x1acce551</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
