Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129XKCZAD.svd
        <register>
          <name>SCSR</name>
          <description>I2C Slave Control/Status</description>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>I2C_SCSR_RREQ</name>
              <description>Receive Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_TXFIFO</name>
              <description>TX FIFO Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_FBR</name>
              <description>First Byte Received</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_OAR2SEL</name>
              <description>OAR2 Address Matched</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_QCMDST</name>
              <description>Quick Command Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_QCMDRW</name>
              <description>Quick Command Read / Write</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_ACTDMATX</name>
              <description>DMA TX Active Status</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_ACTDMARX</name>
              <description>DMA RX Active Status</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <description>I2C Slave Control/Status</description>
          <alternateGroup>I2C0_ALT</alternateGroup>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>I2C_SCSR_DA</name>
              <description>Device Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_TREQ</name>
              <description>Transmit Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_RXFIFO</name>
              <description>RX FIFO Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SDR</name>
          <description>I2C Slave Data</description>
          <addressOffset>0x00000808</addressOffset>
          <fields>
            <field>
              <name>I2C_SDR_DATA</name>
              <description>Data for Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMR</name>
          <description>I2C Slave Interrupt Mask</description>
          <addressOffset>0x0000080C</addressOffset>
          <fields>
            <field>
              <name>I2C_SIMR_DATAIM</name>
              <description>Data Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_STARTIM</name>
              <description>Start Condition Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_STOPIM</name>
              <description>Stop Condition Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_DMARXIM</name>
              <description>Receive DMA Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_DMATXIM</name>
              <description>Transmit DMA Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_TXIM</name>
              <description>Transmit FIFO Request Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_RXIM</name>
              <description>Receive FIFO Request Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_TXFEIM</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_RXFFIM</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRIS</name>
          <description>I2C Slave Raw Interrupt Status</description>
          <addressOffset>0x00000810</addressOffset>
          <fields>
            <field>
              <name>I2C_SRIS_DATARIS</name>
              <description>Data Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_STARTRIS</name>
              <description>Start Condition Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_STOPRIS</name>
              <description>Stop Condition Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_DMARXRIS</name>
              <description>Receive DMA Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_DMATXRIS</name>
              <description>Transmit DMA Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_TXRIS</name>
              <description>Transmit Request Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_RXRIS</name>
              <description>Receive FIFO Request Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_TXFERIS</name>
              <description>Transmit FIFO Empty Raw Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_RXFFRIS</name>
              <description>Receive FIFO Full Raw Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMIS</name>
          <description>I2C Slave Masked Interrupt Status</description>
          <addressOffset>0x00000814</addressOffset>
          <fields>
            <field>
              <name>I2C_SMIS_DATAMIS</name>
              <description>Data Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_STARTMIS</name>
              <description>Start Condition Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_STOPMIS</name>
              <description>Stop Condition Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_DMARXMIS</name>
              <description>Receive DMA Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_DMATXMIS</name>
              <description>Transmit DMA Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_TXMIS</name>
              <description>Transmit FIFO Request Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_RXMIS</name>
              <description>Receive FIFO Request Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_TXFEMIS</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_RXFFMIS</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SICR</name>
          <description>I2C Slave Interrupt Clear</description>
          <addressOffset>0x00000818</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>I2C_SICR_DATAIC</name>
              <description>Data Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_STARTIC</name>
              <description>Start Condition Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_STOPIC</name>
              <description>Stop Condition Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_DMARXIC</name>
              <description>Receive DMA Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_DMATXIC</name>
              <description>Transmit DMA Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_TXIC</name>
              <description>Transmit Request Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_RXIC</name>
              <description>Receive Request Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_TXFEIC</name>
              <description>Transmit FIFO Empty Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_RXFFIC</name>
              <description>Receive FIFO Full Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOAR2</name>
          <description>I2C Slave Own Address 2</description>
          <addressOffset>0x0000081C</addressOffset>
          <fields>
            <field>
              <name>I2C_SOAR2_OAR2</name>
              <description>I2C Slave Own Address 2</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>I2C_SOAR2_OAR2EN</name>
              <description>I2C Slave Own Address 2 Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SACKCTL</name>
          <description>I2C Slave ACK Control</description>
          <addressOffset>0x00000820</addressOffset>
          <fields>
            <field>
              <name>I2C_SACKCTL_ACKOEN</name>
              <description>I2C Slave ACK Override Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SACKCTL_ACKOVAL</name>
              <description>I2C Slave ACK Override Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFODATA</name>
          <description>I2C FIFO Data</description>
          <addressOffset>0x00000F00</addressOffset>
          <fields>
            <field>
              <name>I2C_FIFODATA_DATA</name>
              <description>I2C TX FIFO Write Data Byte</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCTL</name>
          <description>I2C FIFO Control</description>
          <addressOffset>0x00000F04</addressOffset>
          <fields>
            <field>
              <name>I2C_FIFOCTL_TXTRIG</name>
              <description>TX FIFO Trigger</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOCTL_DMATXENA</name>
              <description>DMA TX Channel Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOCTL_TXFLUSH</name>
              <description>TX FIFO Flush</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOCTL_TXASGNMT</name>
              <description>TX Control Assignment</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOCTL_RXTRIG</name>
              <description>RX FIFO Trigger</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOCTL_DMARXENA</name>
              <description>DMA RX Channel Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOCTL_RXFLUSH</name>
              <description>RX FIFO Flush</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOCTL_RXASGNMT</name>
              <description>RX Control Assignment</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOSTATUS</name>
          <description>I2C FIFO Status</description>
          <addressOffset>0x00000F08</addressOffset>
          <fields>
            <field>
              <name>I2C_FIFOSTATUS_TXFE</name>
              <description>TX FIFO Empty</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_TXFF</name>
              <description>TX FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_TXBLWTRIG</name>
              <description>TX FIFO Below Trigger Level</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_RXFE</name>
              <description>RX FIFO Empty</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_RXFF</name>
              <description>RX FIFO Full</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2C_FIFOSTATUS_RXABVTRIG</name>
              <description>RX FIFO Above Trigger Level</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>I2C Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>I2C_PP_HS</name>
              <description>High-Speed Capable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>I2C Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>I2C_PC_HS</name>
              <description>High-Speed Capable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
