Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129XKCZAD.svd
        <register>
          <name>_2_FLTSTAT1</name>
          <description>PWM2 Fault Status 1</description>
          <addressOffset>0x00000908</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_2_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSEN</name>
          <description>PWM3 Fault Pin Logic Sense</description>
          <addressOffset>0x00000980</addressOffset>
          <fields>
            <field>
              <name>PWM_3_FLTSEN_FAULT0</name>
              <description>Fault0 Sense</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSEN_FAULT1</name>
              <description>Fault1 Sense</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSEN_FAULT2</name>
              <description>Fault2 Sense</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_3_FLTSEN_FAULT3</name>
              <description>Fault3 Sense</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSTAT0</name>
          <description>PWM3 Fault Status 0</description>
          <addressOffset>0x00000984</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_3_FLTSTAT0_FAULT0</name>
              <description>Fault Input 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT0_FAULT1</name>
              <description>Fault Input 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT0_FAULT2</name>
              <description>Fault Input 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT0_FAULT3</name>
              <description>Fault Input 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>_3_FLTSTAT1</name>
          <description>PWM3 Fault Status 1</description>
          <addressOffset>0x00000988</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP0</name>
              <description>Digital Comparator 0 Trigger</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP1</name>
              <description>Digital Comparator 1 Trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP2</name>
              <description>Digital Comparator 2 Trigger</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP3</name>
              <description>Digital Comparator 3 Trigger</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP4</name>
              <description>Digital Comparator 4 Trigger</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP5</name>
              <description>Digital Comparator 5 Trigger</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP6</name>
              <description>Digital Comparator 6 Trigger</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWM_3_FLTSTAT1_DCMP7</name>
              <description>Digital Comparator 7 Trigger</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>PWM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>PWM_PP_GCNT</name>
              <description>Generators</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PWM_PP_FCNT</name>
              <description>Fault Inputs (per PWM unit)</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>PWM_PP_ESYNC</name>
              <description>Extended Synchronization</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWM_PP_EFAULT</name>
              <description>Extended Fault</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PWM_PP_ONE</name>
              <description>One-Shot Mode</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>PWM Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>PWM_CC_PWMDIV</name>
              <description>PWM Clock Divider</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_2</name>
                  <description>/2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_4</name>
                  <description>/4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_8</name>
                  <description>/8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_16</name>
                  <description>/16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_32</name>
                  <description>/32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_CC_PWMDIV_64</name>
                  <description>/64</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_CC_USEPWM</name>
              <description>Use PWM Clock Divisor</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
