Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129XKCZAD.svd
        <register>
          <name>DMABAFB0</name>
          <description>LCD DMA Frame Buffer 0 Base Address</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>LCD_DMABAFB0_FB0BA</name>
              <description>Frame Buffer 0 Base Address pointer</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACAFB0</name>
          <description>LCD DMA Frame Buffer 0 Ceiling Address</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>LCD_DMACAFB0_FB0CA</name>
              <description>Frame Buffer 0 Ceiling Address pointer</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMABAFB1</name>
          <description>LCD DMA Frame Buffer 1 Base Address</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>LCD_DMABAFB1_FB1BA</name>
              <description>Frame Buffer 1 Base Address pointer</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACAFB1</name>
          <description>LCD DMA Frame Buffer 1 Ceiling Address</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>LCD_DMACAFB1_FB1CA</name>
              <description>Frame Buffer 1 Ceiling Address pointer</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG</name>
          <description>LCD System Configuration Register</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>LCD_SYSCFG_IDLEMODE</name>
              <description>Idle Mode</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_SYSCFG_IDLEMODE_FORCE</name>
                  <description>Force-idle mode: local target's idle state follows (acknowledges) the system's idle requests unconditionally, that is, regardless of the IP module's internal requirements. Backup mode, for debug only</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_SYSCFG_IDLEMODE_NONE</name>
                  <description>No-idle mode: local target never enters idle state. Backup mode, for debug only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_SYSCFG_IDLEMODE_SMART</name>
                  <description>Smart-idle mode: local target's idle state eventually follows (acknowledges) the system's idle requests, depending on the IP module's internal requirements. IP module shall not generate (IRQ- or DMA-requestrelated) wakeup events</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCD_SYSCFG_STDBY</name>
              <description>Standby Mode</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCD_SYSCFG_STDBY_FORCE</name>
                  <description>Force-standby mode: local initiator is unconditionally placed in standby state. Backup mode, for debug only</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_SYSCFG_STDBY_NONE</name>
                  <description>No-standby mode: local initiator is unconditionally placed out of standby state. Backup mode, for debug only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD_SYSCFG_STDBY_SMART</name>
                  <description>Smart-standby mode: local initiator standby status depends on local conditions, that is, the module's functional requirement from the initiator. IP module shall not generate (initiator-related) wakeup events</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RISSET</name>
          <description>LCD Interrupt Raw Status and Set Register</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>LCD_RISSET_DONE</name>
              <description>Raster or LIDD Frame Done (shared, depends on whether Raster or LIDD mode enabled) Raw Interrupt Status and Set</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_RISSET_RRASTRDONE</name>
              <description>Raster Mode Frame Done interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_RISSET_SYNCS</name>
              <description>Frame Synchronization Lost Raw Interrupt Status and Set</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCD_RISSET_ACBS</name>
              <description>AC Bias Count Raw Interrupt Status and Set</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCD_RISSET_FIFOU</name>
              <description>DMA FIFO Underflow Raw Interrupt Status and Set</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCD_RISSET_PALLOAD</name>
              <description>DMA Palette Loaded Raw Interrupt Status and Set</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCD_RISSET_EOF0</name>
              <description>DMA End-of-Frame 0 Raw Interrupt Status and Set</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCD_RISSET_EOF1</name>
              <description>DMA End-of-Frame 1 Raw Interrupt Status and Set</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISCLR</name>
          <description>LCD Interrupt Status and Clear</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>LCD_MISCLR_DONE</name>
              <description>Raster or LIDD Frame Done (shared, depends on whether Raster or LIDD mode enabled) Enabled Interrupt and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_MISCLR_RRASTRDONE</name>
              <description>Raster Mode Frame Done interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_MISCLR_SYNCS</name>
              <description>Frame Synchronization Lost Enabled Interrupt and Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCD_MISCLR_ACBS</name>
              <description>AC Bias Count Enabled Interrupt and Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCD_MISCLR_FIFOU</name>
              <description>DMA FIFO Underflow Enabled Interrupt and Clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCD_MISCLR_PALLOAD</name>
              <description>DMA Palette Loaded Enabled Interrupt and Clear</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCD_MISCLR_EOF0</name>
              <description>DMA End-of-Frame 0 Raw Interrupt and Clear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCD_MISCLR_EOF1</name>
              <description>DMA End-of-Frame 1 Enabled Interrupt and Clear</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>LCD Interrupt Mask</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>LCD_IM_DONE</name>
              <description>Raster or LIDD Frame Done (shared, depends on whether Raster or LIDD mode enabled) Interrupt Enable Set</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_IM_RRASTRDONE</name>
              <description>Raster Mode Frame Done Interrupt Enable Set</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_IM_SYNCS</name>
              <description>Frame Synchronization Lost Interrupt Enable Set</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCD_IM_ACBS</name>
              <description>AC Bias Count Interrupt Enable Set</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCD_IM_FIFOU</name>
              <description>DMA FIFO Underflow Interrupt Enable Set</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCD_IM_PALLOAD</name>
              <description>DMA Palette Loaded Interrupt Enable Set</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCD_IM_EOF0</name>
              <description>DMA End-of-Frame 0 Interrupt Enable Set</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCD_IM_EOF1</name>
              <description>DMA End-of-Frame 1 Interrupt Enable Set</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IENC</name>
          <description>LCD Interrupt Enable Clear</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>LCD_IENC_DONE</name>
              <description>Raster or LIDD Frame Done (shared, depends on whether Raster or LIDD mode enabled) Interrupt Enable Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_IENC_RRASTRDONE</name>
              <description>Raster Mode Frame Done Interrupt Enable Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_IENC_SYNCS</name>
              <description>Frame Synchronization Lost Interrupt Enable Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCD_IENC_ACBS</name>
              <description>AC Bias Count Interrupt Enable Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCD_IENC_FIFOU</name>
              <description>DMA FIFO Underflow Interrupt Enable Clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCD_IENC_PALLOAD</name>
              <description>DMA Palette Loaded Interrupt Enable Clear</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCD_IENC_EOF0</name>
              <description>DMA End-of-Frame 0 Interrupt Enable Clear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCD_IENC_EOF1</name>
              <description>DMA End-of-Frame 1 Interrupt Enable Clear</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKEN</name>
          <description>LCD Clock Enable</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>LCD_CLKEN_CORE</name>
              <description>LCD Core Clock Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_CLKEN_LIDD</name>
              <description>LIDD Submodule Clock Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_CLKEN_DMA</name>
              <description>DMA Clock Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKRESET</name>
          <description>LCD Clock Resets</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>LCD_CLKRESET_CORE</name>
              <description>Software Reset for the Core, which encompasses the Raster Active Matrix and Passive Matrix logic</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCD_CLKRESET_LIDD</name>
              <description>Software Reset for the LIDD submodule (character displays)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCD_CLKRESET_DMA</name>
              <description>Software Reset for the DMA submodule</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCD_CLKRESET_MAIN</name>
              <description>Software Reset for the entire LCD module</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <memory>
      <name>FLASH</name>
      <description>FLASH Memory Map for TM4C129XKCZAD</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00080000</size>
        <usage>FLASH Memory</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>ROM</name>
      <description>ROM Memory Map for TM4C129XKCZAD</description>
      <baseAddress>0x01000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00008c00</size>
        <usage>ROM Boot Loader/TivaWare</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>SRAM</name>
      <description>SRAM Memory Map for TM4C129XKCZAD</description>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00040000</size>
        <usage>SRAM</usage>
      </addressBlock>
    </memory>
  </vendorExtensions>
</device>
